package com.afd.member.community;

import java.util.Iterator;
import java.util.Random;

public class CommunityReviewDummy {
	
	public static void main(String[] args) {
		
		Random rnd = new Random();
		
		String[] title = {
			
			"보안 소프트웨어 웹 개발자 서적",
			"[리뷰] 쓰면서 익히는 알고리즘과 자료구조",
			"안드로이드 앱 만드는 책 중에 VPN 만드는",
			"[리뷰] Node.js 디자인 패턴 바이블",
			"객체지향 관련 서적 중 조영호님의 오브젝트라는 책을 읽고 정리한 내용입니다.",
			"[리뷰] Docker 도커 실전 가이드",
			"[리뷰] 쓰면서 익히는 알고리즘과 자료구조 리뷰",
			"[리뷰] 실무에 바로 적용하는 안드로이드 프로그래밍 (제4판) , OKKY x 제이펍",
			"자바스크립트 원리? 구조 위주로 설명해주는책 추천해주세요",
			"[리뷰] <그림으로 공부하는 IT 인프라 구조> 인프라에 대한 친절한 설명",
			"[OKKY x 비제이퍼블릭] AWS Lambda로 시작하는 서버리스 책 리뷰입니다.",
			"[리뷰] <시간순삭 파이썬> 접근이 용이한 책",
			"[리뷰] 코드를 통해 본 빵형의 실전 Java (유튜브 동영상 강의 제공, 실무 해결을 위한 실전 학습서)",
			"[리뷰] 객체지향 사고 프로세스",
			"[무료강의] 10년차 풀스택 개발자에게 배우는 취업 포트폴리오 준비 전략",
			"뱅크샐러드, 다노, 우아한형제들 개발자가 들려주는 웹 개발자의 커리어 시작"
			
		};
		
		String[] content = {
			
			"안녕하세요 \r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "보안 소프트웨어 웹 개발자로 있는데 지식이 부족한거 같아서 공부 할 책을 찾고있습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "비전공자 기준에서 초보 ~ 심화, 활용 의 모든 책 추천받습니다 ㅜㅜ\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "참고로 언어는 Golang을 씁니다. 책이 아니더라도 강의 혹은 다른 방법으로 공부 할 방법 알려주시면 감사하겠습니다 ㅜㅜ \r\n"
			+ "\r\n"
			+ "",
			"개인적인 스케줄로 인해 서평이 늦어진점 죄송한 말씀드리며 리뷰를 시작하겠습니다!\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "한줄평\r\n"
			+ "\r\n"
			+ "파이썬으로 알고리즘을 시작하기 좋은 내용들로 구성되어 있다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "책을 읽어나가기 시작할때 가장 좋았던 점은 노트 레이아웃 틀을 이용하는 부분이었습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "마치 먼저 생각하고 코딩하라 느낌처럼 머릿속에 있는 부분들을 명확히 구분지어 적어 내려가며 접근하기에 문제를 해결해나가는데 많은 도움이 되었습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "개인적으로 개발자가 되기 전에는 현업에서 일하면 알고리즘이 꼭 필요할까? 라는 질문에 물음표를 떠올리곤 했습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "하지만 실제 일을 하면서 경험한 결과 알고리즘을 풀어나가는 과정이 결국 문제해결능력과 비슷한 맥락인 것을 깨달았고\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "이 책은 저에게 있어서 문제해결능력의 훈련과 학습의 필요성에 대한 명확한 해답을 주었다고 생각합니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "주니어 개발자로 일하며 여러가지 상황에 부딪히며 늘 한계에 봉착하곤 했었는데요.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "그런 한계를 극복해나가는데 있어 많은 가이드를 해주는 책인것 같습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "다양한 알고리즘이나 자료구조 전체의 내용이 구성된 것은 아니지만 파이썬으로 알고리즘을 입문하는 분들에게는\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "꼭 필요한 기초 내용들은 수록되어 있어 충분히 입문서로 선택하기 좋은 것 같습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "이 외 추가할 내용은 추후 블로그에 자세한 서평을 남기도록 하겠습니다!\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "(이 글은 okky 서적 리뷰 이벤트를 통해 당첨되어 책을 제공받아 작성한 리뷰입니다.)\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "감사합니다 :)",
			"안녕하세요.\r\n"
			+ "\r\n"
			+ "vpn 없으면 정말 불편한 국가에서 살고 있습니다.\r\n"
			+ "\r\n"
			+ "저만의 vpn을 구축하기 위해서 아무것도 모르는 상태에서\r\n"
			+ "\r\n"
			+ "1년만에 세네가지 vpn 을 구축했네요. 사람이 정말 필요하면 뭐든 하게 되나봅니다\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "다름이 아니라 다른 커뮤니티에서 안드로이드 앱 제작 서적에서\r\n"
			+ "\r\n"
			+ "vpn을 만드는 파트가 있었다고 했는데, 그분께 연락드려도 회신이 없으시네요\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "제가 가지고 있는 vpn 서버를 앱으로 제작하여 교민들과 같이 사용하고자 합니다.\r\n"
			+ "\r\n"
			+ "앱은 무료로 드리지만 애드몹을 생각하고 있습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "그래서 그 책을 꼭 알고 싶은데 vpn 제작 관련 안드로이드 앱 서적을\r\n"
			+ "\r\n"
			+ "알고 계신분 있다면 댓글로 꼭 도움받고 싶습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "미리 감사드립니다!",
			"우선 이 책은 영진닷컴 서평 이벤트에 참여해 제공 받은 책임을 밝힙니다\r\n"
			+ "\r\n"
			+ "사실 뽑힐지 모르고 가볍게 신청했는데 무거운 책이 배달되어 당황했던 기억이...\r\n"
			+ "\r\n"
			+ "한 달 내에 서평을 해주셨으면 한다고 하셨는데 기한을 꼬박 채워 하게 되었네요\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "책의 첫인상은 크고 묵직하고... 백과사전이나 국어대사전 같은 느낌이 들어서 과연 다 읽을 수 있을까\r\n"
			+ "\r\n"
			+ "약간 압도 당하는 느낌이었습니다\r\n"
			+ "\r\n"
			+ "워낙 책을 정독으로만 찍어 읽듯이 처음부터 쭉 읽어나가려고만 하는 나쁜 버릇이 있어서\r\n"
			+ "\r\n"
			+ "처음 책을 받고 목차만 가볍게 훑은 후에 한참만에야 몇 챕터를 더 읽고 서평을 적게 되었습니다\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "제목을 보고 소개와 목차까지 읽고 제가 이 책에 기대했던 점은 노드로 서버를 개발할 때\r\n"
			+ "\r\n"
			+ "보다 효율적이고 깔끔하며 좋은 구조를 만드는 방법을 알 수 있지 않을까 였습니다\r\n"
			+ "\r\n"
			+ "옵션으로 좋은 디자인패턴들에 대해 배울 수 있지 않을까 기대하기도 했습니다\r\n"
			+ "\r\n"
			+ "결론부터 말씀드리면 책에 담긴 내용은 제가 기대했던 것과는 조금 달랐습니다\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "구조보다는 노드가 어떤 식으로 구성이 되어있고 활용할 수 있는 기술에는 어떤 것들이 있는지가 주된 내용이었습니다\r\n"
			+ "\r\n"
			+ "디자인패턴은 주된 내용이라기보다는 부가적인 느낌이었던 것 같습니다\r\n"
			+ "\r\n"
			+ "전체적으로 노드에 대해 깊이 파헤치고 소개하면서 활용법을 알려주는 책이었습니다\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "책 제목에 디자인패턴이 들어 있어서 디자인패턴에 좀 더 집중된 내용이지 않을까 오해했는데\r\n"
			+ "\r\n"
			+ "디자인패턴이란 단어가 빠지고 node.js 바이블이란 제목이었으면 조금 더 어울렸을 것 같다는 생각이 듭니다\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "책 소개에 이런 분들께 추천한다는 부분이 있더라고요\r\n"
			+ "\r\n"
			+ "노드를 프로젝트에 본격적으로 활용하려는 개발자\r\n"
			+ "\r\n"
			+ "자바스크립트를 다룰 줄 알면서 노드를 시작하려는 사람\r\n"
			+ "\r\n"
			+ "노드가 어떻게 작동되는지 자세히 알고 싶은 사람\r\n"
			+ "\r\n"
			+ "사실 저는 1, 2번에는 해당이 되어 리뷰 이벤트에 지원을 했던 거였는데\r\n"
			+ "\r\n"
			+ "이 책은 3번에 해당하는 분들께 가장 좋은 책이 아니었을까 싶습니다\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "개인적으로 노드를 실무에서 활용한 적은 없었지만 꽤 큰 사이드 프로젝트를 두 개 정도 했었고\r\n"
			+ "\r\n"
			+ "가장 좋아하는 서버이기도 해서 사이드 프로젝트를 하면 늘 사용하려고 하는데\r\n"
			+ "\r\n"
			+ "책 내용을 이해하고 받아들이기에는 조금 벅차다는 느낌이 강했던 것 같습니다\r\n"
			+ "\r\n"
			+ "주관적인 기준이긴 하지만 입문자나 주니어 개발자가 읽기에는 조금 어렵고 깊은 내용이 아닐까 합니다\r\n"
			+ "\r\n"
			+ "분명 읽어두고 알아두면 매우 큰 도움이 될 것 같은 내용들인데\r\n"
			+ "\r\n"
			+ "그걸 제대로 받아들이고 이해할 수가 없으니 약간 서글퍼지고 자기 반성을 하게 된 시간이었습니다\r\n"
			+ "\r\n"
			+ "그래도 두고두고 읽다 보면 하나씩 이해하고 받아들이고 활용할 수 있는 날이 오겠죠?\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "오키 눈팅은 몇 년째인데 글은 또 처음 쓰는데 이런 글이 될 줄은 몰랐네요ㅎㅎ;\r\n"
			+ "\r\n"
			+ "좋은 책 보내주셨는데 제게 너무 과분한 책이라 좋은 말들로 채워드리지 못해 죄송하네요ㅜㅜ\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "조금 길게 써버려서 이 책을 읽고 느낀 점을 세 줄 요약해보자면\r\n"
			+ "\r\n"
			+ "1.저한텐 너무 어려웠어요ㅜㅜㅜ\r\n"
			+ "\r\n"
			+ "2.노드가 어떻게 작동되는지 자세히 알고 싶은 분들께 추천해요!\r\n"
			+ "\r\n"
			+ "3.좋은 책 보내주셔서 감사하고 두고두고 여러 번 읽어서 꼭 정복하겠습니다~",
			"https://github.com/LenKIM/object-book \r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "객체지향 프로그래밍에 대해서 개안한 기분입니다...!",
			"[리뷰] Docker 도커 실전 가이드\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "1장 Docker 기본에서는 컨테이너, Docker에 대한 설명과 설치방법, Docker 명령어에 대해 다루고 있습니다.\r\n"
			+ "\r\n"
			+ "Docker 명령어는 표로 깔끔하게 정리가 되어 있으며 예제도 함께 기술되어 따라해보며 익히기에 좋습니다.\r\n"
			+ "\r\n"
			+ "다만 명령어 사용시에 다양한 옵션들을 함께 많이 사용을 하는데 명령어 마다 사용가능한 옵션들도 함께\r\n"
			+ "\r\n"
			+ "정리가 되어 있었으면 하는 아쉬움이 남습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "2장 부터는 Docker로 개발환경을 구축하는 방법을 상세하게 설명을 하고 있는데\r\n"
			+ "\r\n"
			+ "PHP, Node, Ruby, Ruby On Rails 등 웹개발을 위한 개발환경을 Docker로 구축하는 방법에 대해\r\n"
			+ "\r\n"
			+ "각 개발환경별로 상세하게 설명을 하고 있습니다.\r\n"
			+ "\r\n"
			+ "아쉽게도 JAVA, tomcat 등 많이 이용하는 JAVA 웹개발 환경에 대한 내용이 없어 아쉽고\r\n"
			+ "\r\n"
			+ "더 나아가 형상관리, 자동배포, 이슈트래커등 CI/CD 환경 구축에 대한 내용이 없어 개인적으로 아쉬움이 남습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "Docker를 한번도 사용해보신 경험이 없으시고 Docker를 처음 이용해보고자 하는 분들에게는 \r\n"
			+ "\r\n"
			+ "컨테이너 개념부터 설치, 명령어 습득에 많은 도움이 되실듯 합니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "감사합니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "(이 글은 OKKY 리뷰 이벤트를 통해 영진닷컴 으로부터 책을 제공받아 작성하게 되었습니다)",
			"이벤트로 받은 쓰면서 익히는 알고리즘과 자료구조에 대한 리뷰입니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "코딩테스트를 준비하기 위해 이런저런 자료구조책들을 보았는데요 이 책만의 다른 점을 위주로 \r\n"
			+ "\r\n"
			+ "리뷰를 작성해볼까 합니다. \r\n"
			+ "\r\n"
			+ "전반적인 목차는 다른 자료구조책과 비슷하게 배열, 리스트, 스택, 큐, 트리, 그래프 등등 비슷합니다. \r\n"
			+ "\r\n"
			+ "각 목차에서는 실제 코딩테스트 사이트의 문제를 가지고 해당 목차에 대해 설명합니다. \r\n"
			+ "\r\n"
			+ "문제를 풀기전에 필요한 어떤 이론이나 언어의 자료구조나 사용방법에 대해 설명을 해주고 \r\n"
			+ "\r\n"
			+ "문제 풀이를 하기전에 어떤방식으로 풀어야 할지를 먼저 생각하게 해줍니다. \r\n"
			+ "\r\n"
			+ "그리고 문제 풀이를 시간복잡도와 공간복잡도를 고려해서 여러 가지의 해결 방안을 제시하는 점이 좋았습니다. \r\n"
			+ "\r\n"
			+ "책에 전반적인 문제 풀이는 파이썬으로 작성되어 있는데 저는 자바 개발을 하고 있어서 자바로 풀어보았습니다. \r\n"
			+ "\r\n"
			+ "혹시 참고하실 분들이 있을까봐 github 링크를 남깁니다. (자바 문제풀이 )\r\n"
			+ "\r\n"
			+ "문제를 하나하나 풀어보다보니 아직 다 보지는 못해서 github 에는 스택과 재귀 부분까지만 코드가 있습니다.\r\n"
			+ "\r\n"
			+ "저는 특히 책 내용중에 좋았던 부분은 재귀함수와 트리 부분인 것 같습니다. 이 부분을 어려워 했고 아직도 \r\n"
			+ "\r\n"
			+ "어렵긴 하지만 책에 있는 내용들을 몇번 보고 문제를 풀어보다보니 도움이 많이 되었습니다.\r\n"
			+ "\r\n"
			+ "어떤 언어로 코딩 테스트를 준비하던지 이 책의 내용들이 도움이 될 거라고 생각합니다. ",
			"한줄 리뷰: 진짜 안드로이드 실무를 배울수 있는 책\r\n"
			+ "                (Feat by Kotlin.)\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "2판, 다시 4판\r\n"
			+ "제가 처음 안드로이드 공부를 시작할 때, 본도서의 2판을 처음 봤었습니다. 물론 국내책이면서 판매순위도 높은 안드로이드 도서들도 있었습니다. 하지만 막상 서점에서 책을 읽어보고는 아 이거다! 하고 고른책이 2판이였던 기억이 나네요. 그렇지만 시간이 흐르고 2판의 내용이 outdate되가면서, 2판을 꺼내보는 일이 적어졌었는데, 5년차 개발자가 된 지금, 시기적절하게 4판을 다시 만나게 되었습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "실무를 하는데 가장 필요한 안드로이드의 핵심을 배울수 있습니다.\r\n"
			+ "책을 읽으며 코드를 작성하다 보면, 왜 내가 이렇게 코드를 짜야하는지 이해가 되도록 정확한 타이밍에 설명을 해줍니다.\r\n"
			+ "\r\n"
			+ "가장 맘에 들었던 부분은, 혼자 doc찾아 보면서 수 있는 여러가지 위젯을 일일히 나열하는데 지면을 낭비하지 않고,\r\n"
			+ "\r\n"
			+ "MVVM, JUnit,접근성 등 실무에 꼭 필요하지만 다른 책에는 없는 내용이 간결하고 정확하게 설명된다는 점이였습니다.\r\n"
			+ "\r\n"
			+ "그리고 이제는 당연하지만 Kotlin과 Android Jetpack 라이브러리를 사용하였다는 점도요:)\r\n"
			+ "\r\n"
			+ "머리 속에서 정리 안되던 지식들이 깔끔하게 정리되는 느낌을 받았습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "번역서인데, 번역서가 아닌 느낌\r\n"
			+ "번역체 특유의 느낌 없이, 마치 국내 도서 같은 느낌으로 읽었습니다. 수많은 IT책을 번역한 심재철님의 내공 덕분인 것 같네요. \r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "결론: Amazon Android Development 1위에 걸맞는 훌륭한 책!\r\n"
			+ "책을 판매순위만으로 평가 할 수는 없지만, 어느정도 지표가 될수있다고 생각합니다. 특히 이 책은 아마존에서 출판 이후 계속 1위을 놓지 않은 책으로 알고 있습니다. 안드로이드 본진에서 인정받은 책이란거죠.\r\n"
			+ "\r\n"
			+ "우리나라에서도 이렇게 좋은 퀄리티의 책을 만들어 주셔서 감사합니다. 퀄리티만큼 많은 안드로이드 개발자 분들이 보셨으면 좋겠네요!! 2,4판 사진으로 마무리합니다!.",
			" 안녕하세요. \r\n"
			+ "\r\n"
			+ "제가 요즘 자바스크립트를 더 깊게 배우고싶어 책이 있나 찾아보고있습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "변수가 선언되고 값이 할당될때 메모리에 어떻게 올라가는지, 콜스택 힙이 어떻게 동작하는지\r\n"
			+ "\r\n"
			+ "다른언어에서 문자열은 문자배열로 다룬다고 들었는데 자바스크립트에선 어떤 구조로 문자열을 다루는지 등등 자바스크립트에대해 깊게 배우고싶습니다.\r\n"
			+ "\r\n"
			+ "그래서 구글로 좀 찾아보긴하는데 한계가 있네요. 그래서 책을 찾아보고있습니다.\r\n"
			+ "\r\n"
			+ "찾아보고 있는중에 코어 자바스크립트를 봤는데 괜찮을까요?\r\n"
			+ "\r\n"
			+ "그리고 다른 책도 괜찮은게 있다면 추천해주시면 감사하겠습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "05.14 수정\r\n"
			+ "\r\n"
			+ "제가 본책은\r\n"
			+ "\r\n"
			+ "Do it! 웹 프로그래밍을 위한 자바스크립트 기본편\r\n"
			+ "\r\n"
			+ "모던 자바 스크립트 Deep Dive\r\n"
			+ "\r\n"
			+ "입니다.",
			"그간 주어진 환경 하에서 코딩만 하다가 올해 처음으로 인프라쪽 업무를 처음 하게 되었습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "문제가 발생할 때마다 인터넷상의 기술 문서들만 보면서 적당히 업무를 처리했습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "하지만 그간 그렇게 쌓은 저의 인프라분야 지식과 경험은 조각조각나있어 정리가 안 되어있다는 불안감을 동반하고 있었습니다. 그래서 예측 불가능한 잘 모르는 새로운 문제가 터질까봐 항상 불안했습니다. 언제든 백업만 해놓으면 원상복구시킬 수 있는 코드와 달리 인프라 분야는 문제가 한 번 터지면 수습이 불가능할 것 같아 늘 불안했습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "이 책을 읽으면서 그렇게 중구남방으로 흩어져있던 인프라 쪽 지식들이 많이 정리가 된다는 느낌을 받았습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "책의 내용은 인프라에 대한 아키텍처나 시스템 구성 요소에 대한 기초적인 내용부터 응용 기술까지 복합적으로 다룹니다.  인프라 장비들의 기본 구성요소에 대한 내용들을 쉽게 전달하며, 다양한 종류의 기술 요소들 역시 하나하나 차근차근 설명하고 있습니다. \r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "제가 단순히 스택오버플로우를 보거나 그때그때 찾아보며 해결했던 문제들의 아래에서 어떤 일이 일어나고 있는지에 대한 그림이 그려진다는 생각이 들었습니다. \r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "사실 저는 워낙 인프라 초보라 후반의 응용파트는 좀 이해하기 어려운 부분도 있었습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "하지만 친절한 예시나 삽화가 많이 있어 글을 읽다가 머리를 쥐어뜯고 포기하기 직전에 이해가 되어 다행이었습니다. (어려운 책은 아무리 내용이 좋고 많은 것을 담고 있어도 쉽게 읽기를 포기하게 됩니다)\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "책을 보면서 인프라에 대한 전반적인 내용에 대한 이해도가 많이 올라갔고,\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "향후 서버 관리 중 에러가 발생했을 때 두려워하지 않고 문제의 근본 원인을 파악하는데 큰 도움이 될 것 같습니다. 직접 문제 해결을 하는 질의응답형 책은 아니지만, 원리를 알고 현상을 바라보는것과 단순히 문제를 해결하고 잊어버리는 데는 큰 차이가 있을 것 같습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "책을 읽으며 그간 IT서적을 너무 안읽고 체계적인 지식이 없이 모래성을 쌓고 있다는 느낌이 들어 많이 반성했고 앞으로 IT서적을 한달에 한 권이라도 읽도록 노력해야겠다는 생각을 했습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "인프라 업무를 처음 하게 된 많은 분께 이 책을 추천드립니다.  IT인프라에 대한 명확한 개념을 가지고자 하는 분들은 꼭 한번 읽어봐야할 책이라는 생각이 듭니다.",
			"컴퓨터 관련 과를 재학중인 대학생으로 iot,인공지능, 앱 등 관심을 가지며 공부를 하던중 개인적으로 하고싶은 프로젝트를 진행함에 있어서 서버에 대한 필요와 공부가 중요하다는 생각을 했지만 이미 관심분야를 공부만 하더라도 서버, 네트워크 공부를 할 시간이 많이 부족했습니다. 그러던 중 이번 aws 리뷰이벤트에서 aws 책을 받게되어 서버리스에 대한 개념과 aws 활용법등 다양한 정보들을 알게되어서 평소 관심있는 분야로 프로젝트를 진행 하게되었습니다. \r\n"
			+ "평소 공부를 열심히 하는 성격은 아니였는데 이번 프로젝트를 진행 해보면서 뭔가 많은 것을 알게되어서 자신감도 생기고 책을 보며 알게된 aws로 더 많은 것을 할 수 있을거라고 생각이 들었습니다.\r\n"
			+ "\r\n"
			+ "책에대한 내용은 입문을 위한 내용으로 비교적 어렵지 않은 내용과 그림, 아키텍처등으로 설명을 해서 매우 쉽게 aws에 대해 공부를 할 수 있으며 바로 따라서 실습해볼 수 있는 장점이 있는 책입니다. aws 자체가 이미 만들어진 서버리스 도구를 이용하는 느낌이다 보니까 심화된 내용이 필요가 없다 생각했고 이정도의 설명이면 딱 좋은 수준의 책이라고 생각 했습니다. 더할나위 없이 좋은 입문 책이며 더욱이 많은 프로젝트를 진행할 기회를 얻은 것 같아서 책을 제공해준 okky에게 감사의 말씀 드리고 싶습니다.\r\n"
			+ "aws를이용해 프로젝트를 진행해본 내용을 깃헙에 올려놨습니다.\r\n"
			+ "github.com/parkyeomyeong/Ai-CCTV",
			"※ 본 리뷰는, 이벤트에 당첨되어 책을 제공받아 진행하였습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "책을 처음 접하는 순간 든 생각은 기존의 딱딱한 기술 서적과는 다르게 글씨도 적당하고\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "컬러판이라 눈이 즐거웠습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "파이썬이라는 언어를 처음 접하는 저로써는 그림과 함께 있는 설명 덕분에 이해가 굉장이 쉬웠고\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "책을 읽으며 지루함이 상당히 적었습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "그래픽과 알고리즘이 예제속에 녹아있어서 언어공부를 하면서 동시에 알고리즘을 공부 할 수 있었습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "파이썬을 이용한 서비스 소스, 파이썬의 특성과 기능을 빠르게 익히고 싶은 분들은 어울리지 않는 책입니다. 참고 부탁드립니다.(해당 내용까지 전부 들어가면 책의 두께가 상당해 질듯 합니다.)\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "처음으로 파이썬을 공부하며 기본 문법과 알고리즘, 그래픽 개념에 대해서 학습하고 싶으신 분들에게는\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "추천드리고 싶은 책입니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "이렇게 좋은 책을 읽을 수 있도록 이벤트를 진행해 주셔서 감사합니다.",
			"코드를 통해본 빵형의 실전java 리뷰입니다. 기존 java책은 신입이 실무에서 잘 사용하지않는\r\n"
			+ "\r\n"
			+ "스윙, 쓰레드등을 주로 다루나 이 책은 나중에 쓰일 람다나 스트림 어노테이션 등\r\n"
			+ "\r\n"
			+ "신입에게 불필요한 내용은 건너뛰고 나중에 스프링 공부할떄 필요한 내용들을 미리 경험해 볼 수 있습니다. 혼자 책을 통해서 공부하기 어려울때는 유튜브 영상도 제공하니까 영상을 보거나\r\n"
			+ "\r\n"
			+ "카페 https://cafe.naver.com/curiouscode  에질문을 달으시면  도움을 받을 수 있습니다.\r\n"
			+ "\r\n"
			+ "빵형님 유튜브 구독자로서 책 정말 잘 만드셨는데\r\n"
			+ "\r\n"
			+ "홍보가 안된거같아서 신입개발자분이나 취준생이 보시면 좋을 것 같아 추천합니다~",
			"OKKY 리뷰 이벤트에 당첨되어 객체지향 사고 프로세스 책을 읽고 리뷰를 쓰게 되었습니다. 현재 저는 신입개발자로 아직 1년이 안된 상태이고 현제 맡은 업무가 레거시에서 Spring Boot로 이관하는 작업을 진행하는 중이었습니다. 코드를 이관 하면서 조금 옛날 코드들을 빼고 간결하게 했고 기능 구현에는 문제가 없었지만 내가 만든 코드가 정말 잘 짠건지 객체지향은 맞는지에 대한 의문이 들었고 이책을 보면서 리팩토링 해보자는 생각이 들었습니다.\r\n"
			+ "\r\n"
			+ " \r\n"
			+ "\r\n"
			+ "이책을 보면서 든 느낌은 되게 개념적인 부분들을 잘 정리 했다는 생각이 들었습니다. 다른 책에는 없는 합성이란 개념도 넣었고 그림으로 설명하는 부분들도 이해를 좀 더 편하게 만들어 주는 것 같았습니다. 특히 제가 면접준비할때 공부 했던 내용들이 많아서 취업 준비생분들이나 처음부터 공부를 하시는 분들께 한번 쭉 읽고 정리하면 상당히 도움이 되지 않을까란 생각이 들었습니다.  아쉬웠던 부분은 여러 다른책과 다르지않게 이 개념을 익혀서 실무에 어떻게 적용하면 되는 지에 대한 부분이 나와있지 않아서 제가 지금 업무 적용하기에는 조금 개념적이다. 라는 생각이 들었습니다. 그리고 주니어, 시니어 개발자분들에게는 이미 다 아는 많이 본 내용들일거라는 생각이 들어서 신입이나 취업준비생, 새롭게 공부하시는 분들께 추천 드리고 싶습니다.",
			"대상\r\n"
			+ "취업 준비를 하는 취준생\r\n"
			+ "이직을 준비하는 개발자\r\n"
			+ "실력 향상을 꿈꾸는 개발자\r\n"
			+ "다루는 내용\r\n"
			+ "포트폴리오를 준비하는 이유\r\n"
			+ "우리는 어떤 포트폴리오를 준비해야 할까\r\n"
			+ "흔히들 하는 실수\r\n"
			+ "포트폴리오가 면접에 미치는 영향\r\n"
			+ "Q&A\r\n"
			+ "강사\r\n"
			+ "김범준\r\n"
			+ "\r\n"
			+ "10년차 풀 스택 소프트웨어 엔지니어 (프로필 링크 )\r\n"
			+ "(전) 실리콘벨리 스타트업 초기 멤버 (시리즈 B까지 경험, 현재 시리즈 C 투자 유치 유니콘 기업)\r\n"
			+ "창업 1회, SI, 스타트업 등 다양한 경험 (상세 경력 링크 )\r\n"
			+ "비전공자 및 전공자 대상 프로그래밍 교육 다수 경험\r\n"
			+ "스타트업 및 개발자 대상 커리어 상담과 컨설팅 경험 (리뷰 링크 )\r\n"
			+ "수업 일시\r\n"
			+ "6월19일(토) 오전 11시부터 약 40분 간\r\n"
			+ "\r\n"
			+ "상세내용 & 참가방법\r\n"
			+ "카우치코딩 사이트  이벤트 페이지에서 <웹개발 포트폴리오 준비하기> 상세보기 혹은 신청하기 클릭",
			"안녕하세요! 웹 개발자로 커리어를 시작하는 분들을 대상으로 무료 이벤트가 있어 공유드립니다.\r\n"
			+ "\r\n"
			+ "zoom으로 진행하는 이벤트인데, 실시간 Q&A도 받는다고 해서 개발자 커리어에 고민이 있는 분들께 도움이 될 것 같아요!\r\n"
			+ "\r\n"
			+ "행사 링크도 함께 첨부합니다! https://www.wanted.co.kr/events/careertalk18 \r\n"
			+ "\r\n"
			+ ""
			
			
		};
		
		String[] comment = {
			
			"안녕하세요!\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "대학때 보안쪽 공부하다가 첫 회사인 스타트업에서 Go로 개발해야했던 상황이 있어서 공감이 되는데요,,!ㅠㅠ 제가 도움받은 자료를 공유할께요!\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "1. 보안 배경 지식 공부법\r\n"
			+ "\r\n"
			+ "https://covenant.tistory.com/144  \r\n"
			+ "\r\n"
			+ "- 강의, 서적 추천이 되어있습니다!\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "2. 네트워크 배경 지식 공부법 \r\n"
			+ "\r\n"
			+ "https://covenant.tistory.com/222 \r\n"
			+ "\r\n"
			+ "-마찬가지로 강의, 서적 추천이 되어있습니다!\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "3. GO 좋은 설명글,  프로젝트 모음\r\n"
			+ "\r\n"
			+ "https://github.com/brave-people/Awesome-Dev-Contents/blob/master/3.%EB%B2%A1%EC%97%94%EB%93%9C/go.md \r\n"
			+ "\r\n"
			+ "- 검색했을때 유독 Go가 장난감 같은 예제가 많아서 실무에 어떻게 적용했는지 막막했는데요,,! 래퍼런스할만한 좋은 프로젝트를 모아놓은 저장소입니다!",
			"감사합니다!",
			"중국에서 지내시는가 보네요\r\n"
			+ "\r\n"
			+ "vpn 서버만 만드셨으면 굳이 앱을 만들 필요 없이\r\n"
			+ "\r\n"
			+ "안드로이드나 아이폰 자체 시스템에서 vpn 지원이 됩니다.\r\n"
			+ "\r\n"
			+ "시스템 설정으로 님 서버에 접속하면 끝이에요.",
			"너무 어렵게 하시는것 같스빈다.\r\n"
			+ "\r\n"
			+ "안드로이드는 기기설정에 네트워크탭에 VPN 연결하는게 있쩌여. 서버는 벌처 같은 클라우드 서비스에 도커를 쓰는 것이 편하빈다.\r\n"
			+ "\r\n"
			+ "이케하면 남이 만들어놓은걸 그대로 쓰니깐 키 라던가 패스워드라던가 이런거만 주의하면 되는것이저.",
			"이걸 앱으로 만들어서 무료로 드리겠지만\r\n"
			+ "\r\n"
			+ "애드몹도 생각을 하고 드린 질문이었는데\r\n"
			+ "\r\n"
			+ "설명이 충분하지 않았네요",
			"shadowsocks 있지 않나요?",
			"엌ㅋㅋㅋㅋㅋ\r\n"
			+ "\r\n"
			+ "저도 이거 서평단 당첨되고, 어제가 마지막이라 쓰고 있었는데 저 같은 사람이 있었군요...",
			"아...이책.ㅋㅋㅋㅋ",
			"서점 오다가다 특이해서 이름만 봤던 책인거 같네요.\r\n"
			+ "\r\n"
			+ "실제로 커뮤니티 보다보면 이와 비슷한 주장을 하시던 분을 몇몇 봤습니다.\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "\r\n"
			+ "특히 DB에서 스키마를 일부러 복잡하게 만들어놓는다던가, 테이블을 쪼개서 SELECT 쿼리를 괴랄하게 만들게끔 강제한다던가...",
			"\"나만 알아볼수 있게 복잡하게 만들어야 내 밥줄이 안끊어져\"\r\n"
			+ "\r\n"
			+ "실제 이렇게 노골적으로 개발하신분이 계셨는데.\r\n"
			+ "\r\n"
			+ "압도적으로 프로젝트 장애 no.1 가볍게 드시고.\r\n"
			+ "\r\n"
			+ "본인도 나중에 자기소스에 자기가 해깔려서 해결못하고 out되셨습니다.ㅋ",
			"깃헙이랑 블로그 봤는데 열심히 하시는게 보이네요 잘봤습니다.",
			"개인적으로 궁금해서 질문드립니다 깃에 서적관련 코드나 내용 올리는게 저작권 영향을 따로 받지 않나요?? ",
			"언제 리뷰 이벤트 진행된 건이었나요? 못봣던것 같은데요 \r\n"
			+ "\r\n"
			+ "리뷰 감사합니다.",
			"와, 이게 번역되다니",
			"제가 리디북스에 사두고 안 읽는 책이  있는데 아쉽게도 선물이 안되네요 ㅋㅋ\r\n"
			+ "\r\n"
			+ "인사이드 자바스크립트 라는 책의 목차입니다 \r\n"
			+ "\r\n"
			+ "찾으시는 것처럼 깊이 있는 내용인것 같은데 그만큼 안 읽어지더군요 😪",
			"저도 \r\n"
			+ "\r\n"
			+ "모던 자바스크립트 Deep Dive\r\n"
			+ "\r\n"
			+ "추천 꽤 두껍습니다",
			"요즘은 J쿼리를 자바스크립트라고 말하는 사람들이 있더라구요.\r\n"
			+ "\r\n"
			+ "분명히 다른거지만 어쩻든 경계가 불분명해 져서 뭘 말씀하시는지 모르겠지만\r\n"
			+ "\r\n"
			+ "순수한 자바스크립트라면 계층구조를 이해하는게 가장 빠릅니다.\r\n"
			+ "\r\n"
			+ "예를들어  DIV테그 안에는 어떤 객체들과 속성들이 있고,\r\n"
			+ "\r\n"
			+ "그 안에 있는 객체들에는 또 어떤 객체들과 속성들이 있는지.\r\n"
			+ "\r\n"
			+ "그리고 그 안에는 또.....\r\n"
			+ "\r\n"
			+ "그러다 보면 끝이 없이 깊이 들어가게 되는데요.\r\n"
			+ "\r\n"
			+ "그렇게 끝없이 따라 들어가다 보면 깨우치는 바가 있습니다.\r\n"
			+ "\r\n"
			+ "그걸 깨우치면 자바스크립트 공부는 완벽하게 끝난겁니다.\r\n"
			+ "\r\n"
			+ "기왕이면 그 계층구조를 보여주는 코드를 자바스크립트로 만들어 보시는 것도 좋습니다.\r\n"
			+ "\r\n"
			+ "그거 하나만 있으면 자바스크립트는 공부할 필요도 없거든요.",
			"곰곰이님, 상세한 후기 감사드립니다 :)",
			"오 저도 보고 싶네요 ",
			"깃헙 레포에 프로젝트까지 올려주셨군요 :)\r\n"
			+ "\r\n"
			+ "감사합니다 여띵 님, 앞으로도 OKKY에 많은 관심과 참여 부탁드릴게요 :)",
			"LamiNate님, 안녕하세요^^ 생능출판사입니다.\r\n"
			+ "\r\n"
			+ "저도.. 이렇게 이벤트 진행할 수 있도록 도와주신 OKKY 운영진 분들과\r\n"
			+ "\r\n"
			+ "참여해주신 분들께 다시 한 번 감사의 인사를 드립니다^^\r\n"
			+ "\r\n"
			+ "적절한 그림과 가독성 좋은 편집을 통해 지루함을 없애는 것이 이 책의 목표 중 하나인데\r\n"
			+ "\r\n"
			+ "조금이나마 도움이 되었다니 저희도 기쁩니다^^\r\n"
			+ "\r\n"
			+ "책의 특징을 잘 파악하시고 어떤 분들에게 적합한 지 설명해 주셔서 \r\n"
			+ "\r\n"
			+ "이 글을 읽는 분들께 많은 도움이 될 것 같습니다.\r\n"
			+ "\r\n"
			+ "소중한 리뷰 정말 정말 감사합니다^^ ",
			"코딩 공부하기 전에 읽으면 좋은 책 같아요.\r\n"
			+ "\r\n"
			+ "전 구현부랑 인터페이스를 발전소랑 콘센트로 비유해서 설명해놓은 부분이 확 와닿더라고요.ㅎ \r\n"
			+ "\r\n"
			+ "같은 책 읽은 분 리뷰를 OKKY에서 보니 반갑네요 ㅎ ",
			"원서 자체도 출판영어? 가 아니어서 굉장히 어려웠는데 번역서 또한 어렵네요 이제 70페이지 지나는데 뒤로 가면 갈수록 나아지겠죠?"
			
			
		};
		
		String[] regdate = {
				
				"2021-07-01",
				"2021-07-02",
				"2021-07-03",
				"2021-07-04",
				"2021-07-05",
				"2021-07-06",
				"2021-07-07",
				"2021-07-08",
				"2021-07-09",
				"2021-07-10",
				"2021-07-11",
				"2021-07-12",
				"2021-07-13",
				"2021-07-14",
				"2021-07-15",
				"2021-07-16",
				"2021-07-17",
				"2021-07-18",
				"2021-07-19",
				"2021-07-20",
				"2021-07-21",
				"2021-07-22",
				"2021-07-23",
				"2021-07-24",
				"2021-05-01",
				"2021-05-02",
				"2021-05-03",
				"2021-05-04",
				"2021-05-05",
				"2021-05-06",
				"2021-05-07",
				"2021-05-08",
				"2021-05-09",
				"2021-05-10",
				"2021-05-11",
				"2021-05-12",
				"2021-05-13",
				"2021-05-14",
				"2021-05-15",
				"2021-05-16",
				"2021-05-17",
				"2021-05-18",
				"2021-05-19",
				"2021-05-20",
				"2021-05-21",
				"2021-05-22",
				"2021-05-23",
				"2021-05-24",
				"2021-05-25",
				"2021-05-26",
				"2021-05-27",
				"2021-05-28",
				"2021-05-29",
				"2021-05-30",
				"2021-06-01",
				"2021-06-02",
				"2021-06-03",
				"2021-06-04",
				"2021-06-05",
				"2021-06-06",
				"2021-06-07",
				"2021-06-08",
				"2021-06-09",
				"2021-06-10",
				"2021-06-11",
				"2021-06-12",
				"2021-06-13",
				"2021-06-14",
				"2021-06-15",
				"2021-06-16",
				"2021-06-17",
				"2021-06-18",
				"2021-06-19",
				"2021-06-20",
				"2021-06-21",
				"2021-06-22",
				"2021-06-23",
				"2021-06-24",
				"2021-06-25",
				"2021-06-26",
				"2021-06-27",
				"2021-06-28",
				"2021-06-29"
				
		};
		
		int n = 0;
		
		for (int i=0; i<40; i++) {
			
			int memberSeq = (int)rnd.nextInt(100) + 1;
			int commentSeq = (int)rnd.nextInt(23) + 1;
			int communitySeq = (int)rnd.nextInt(40) + 1;
			
//			System.out.printf("insert into tblCommunity (communitySeq, memberSeq, category, title, content, regdate, readCount) values (communitySeq.nextVal, %d,  '기술 서적 리뷰', '%s', '%s', '%s', default);\r\n", memberSeq, title[n], content[n], regdate[rnd.nextInt(regdate.length)]);
			
			n++;
			
			if (n > 13) {
				n = 0;
			}
			
			System.out.printf("insert into tblCommunityComment (commentSeq, memberSeq, communitySeq, content, regdate) values (commentSeq.nextVal, %d, %d, '%s', '%s');\r\n", memberSeq, communitySeq, comment[rnd.nextInt(comment.length)], regdate[rnd.nextInt(regdate.length)]);
			
		}
		
	}

}




